app/controllers/admin/films_controller.rb

INSERT INTO "tags" ("name") VALUES (?)  [["name", "as"]]
---
  def create
    @film = current_user.films.build(films_params)
    tag_list = params[:tag_list].split(",")
    if @film.save
      @film.save_tags(tag_list)