app/controllers/admin/films_controller.rb

  def create
    @film = Film.new(film_params)
    if @film.save
---
INSERT INTO "films" ("title", "based", "release", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["based", ""], ["release", ""], ["language", ""], ["created_at", "2019-07-14 03:17:53.521351"], ["updated_at", "2019-07-14 03:17:53.521351"]]

  def show
    @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @film = Film.find(params[:id])
    if @film.update(film_params)
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "films" SET "image_id" = ?, "based" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["image_id", "d7cb761c77177f3f175a80a615ad978deb6c95146b043ec00be280d7c627"], ["based", ""], ["updated_at", "2019-07-20 06:13:57.612587"], ["id", 1]]

  def destroy
    @film = Film.find(params[:id])
    if @film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 4]]