app/controllers/films_controller.rb

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @film = Film.find(params[:id])