app/controllers/relationships_controller.rb

  def create
	follow = current_user.active_relationships.build(follower_id: params[:user_id])
	follow.save
---
INSERT INTO "relationships" ("following_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["following_id", "2"], ["follower_id", "1"], ["created_at", "2019-07-09 16:58:01.837733"], ["updated_at", "2019-07-09 16:58:01.837733"]]

  def destroy
  	follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]